
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.device["R10"].netbox_available_prefix.tunnels_v4["CR3"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "147"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_available_prefix.tunnels_v4["CR4"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "148"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_available_prefix.tunnels_v4["CR5"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "167"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_available_prefix.tunnels_v4["CR6"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "437"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "281"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "301"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "350"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "851"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "280"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "298"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "358"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "848"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_vlan_group.group will be updated in-place
  ~ resource "netbox_vlan_group" "group" {
        id          = "9"
      ~ max_vid     = 0 -> 256
      ~ min_vid     = 0 -> 1
        name        = "R10"
        tags        = []
        # (4 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_available_prefix.tunnels_v4["CR3"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "159"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_available_prefix.tunnels_v4["CR4"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "160"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_available_prefix.tunnels_v4["CR5"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "168"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_available_prefix.tunnels_v4["CR6"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "438"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "340"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "342"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "351"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "850"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "339"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "341"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "359"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "843"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_vlan_group.group will be updated in-place
  ~ resource "netbox_vlan_group" "group" {
        id          = "15"
      ~ max_vid     = 0 -> 256
      ~ min_vid     = 0 -> 1
        name        = "R14"
        tags        = []
        # (4 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_available_prefix.tunnels_v4["CR3"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "154"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_available_prefix.tunnels_v4["CR4"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "156"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_available_prefix.tunnels_v4["CR5"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "253"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_available_prefix.tunnels_v4["CR6"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "436"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "317"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "319"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "567"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "855"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "316"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "318"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "571"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "844"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_vlan_group.group will be updated in-place
  ~ resource "netbox_vlan_group" "group" {
        id          = "12"
      ~ max_vid     = 0 -> 256
      ~ min_vid     = 0 -> 1
        name        = "R15"
        tags        = []
        # (4 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_available_prefix.tunnels_v4["CR3"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "283"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_available_prefix.tunnels_v4["CR4"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "284"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_available_prefix.tunnels_v4["CR5"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "288"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_available_prefix.tunnels_v4["CR6"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "433"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "632"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "634"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "636"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "852"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "626"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "628"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "630"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "846"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_vlan_group.group will be updated in-place
  ~ resource "netbox_vlan_group" "group" {
        id          = "13"
      ~ max_vid     = 0 -> 256
      ~ min_vid     = 0 -> 1
        name        = "R18"
        tags        = []
        # (4 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_available_prefix.tunnels_v4["CR3"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "227"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_available_prefix.tunnels_v4["CR4"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "228"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_available_prefix.tunnels_v4["CR5"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "258"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_available_prefix.tunnels_v4["CR6"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "432"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "516"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "514"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "569"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "854"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "515"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "513"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "573"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "849"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_vlan_group.group will be updated in-place
  ~ resource "netbox_vlan_group" "group" {
        id          = "11"
      ~ max_vid     = 0 -> 256
      ~ min_vid     = 0 -> 1
        name        = "R19"
        tags        = []
        # (4 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_available_prefix.tunnels_v4["CR3"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "369"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_available_prefix.tunnels_v4["CR4"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "368"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_available_prefix.tunnels_v4["CR5"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "367"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_available_prefix.tunnels_v4["CR6"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "435"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "714"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "713"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "716"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "853"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "706"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "711"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "709"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "847"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_vlan_group.group will be updated in-place
  ~ resource "netbox_vlan_group" "group" {
        id          = "14"
      ~ max_vid     = 0 -> 256
      ~ min_vid     = 0 -> 1
        name        = "R20"
        tags        = []
        # (4 unchanged attributes hidden)
    }

  # module.device["R21 Dagotest"].netbox_available_prefix.tunnels_v4["CR3"] is tainted, so must be replaced
-/+ resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR3 to R21 Dagotest (DagoHD14)"
      ~ id               = "466" -> (known after apply)
      - is_pool          = false -> null
      - mark_utilized    = false -> null
      ~ prefix           = "10.129.0.2/31" -> (known after apply)
      ~ role_id          = 0 -> 1
      - site_id          = 0 -> null
      - tags             = [] -> null
      ~ tenant_id        = 0 -> 2
      - vlan_id          = 0 -> null
        # (4 unchanged attributes hidden)
    }

  # module.device["R21 Dagotest"].netbox_available_prefix.tunnels_v4["CR4"] is tainted, so must be replaced
-/+ resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR4 to R21 Dagotest (DagoHD14)"
      ~ id               = "468" -> (known after apply)
      - is_pool          = false -> null
      - mark_utilized    = false -> null
      ~ prefix           = "10.129.0.6/31" -> (known after apply)
      ~ role_id          = 0 -> 1
      - site_id          = 0 -> null
      - tags             = [] -> null
      ~ tenant_id        = 0 -> 2
      - vlan_id          = 0 -> null
        # (4 unchanged attributes hidden)
    }

  # module.device["R21 Dagotest"].netbox_available_prefix.tunnels_v4["CR5"] is tainted, so must be replaced
-/+ resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR5 to R21 Dagotest (DagoHD14)"
      ~ id               = "467" -> (known after apply)
      - is_pool          = false -> null
      - mark_utilized    = false -> null
      ~ prefix           = "10.129.0.4/31" -> (known after apply)
      ~ role_id          = 0 -> 1
      - site_id          = 0 -> null
      - tags             = [] -> null
      ~ tenant_id        = 0 -> 2
      - vlan_id          = 0 -> null
        # (4 unchanged attributes hidden)
    }

  # module.device["R21 Dagotest"].netbox_available_prefix.tunnels_v4["CR6"] is tainted, so must be replaced
-/+ resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to R21 Dagotest (DagoHD14)"
      ~ id               = "469" -> (known after apply)
      - is_pool          = false -> null
      - mark_utilized    = false -> null
      ~ prefix           = "10.129.0.8/31" -> (known after apply)
      ~ role_id          = 0 -> 1
      - site_id          = 0 -> null
      - tags             = [] -> null
      ~ tenant_id        = 0 -> 2
      - vlan_id          = 0 -> null
        # (4 unchanged attributes hidden)
    }

  # module.device["R21 Dagotest"].netbox_device_interface.lan["1"] will be created
  + resource "netbox_device_interface" "lan" {
      + description                = "Management"
      + device_id                  = 428
      + enabled                    = true
      + id                         = (known after apply)
      + label                      = "Management"
      + name                       = "eth1.1"
      + parent_device_interface_id = 1406
      + type                       = "virtual"
    }

  # module.device["R21 Dagotest"].netbox_device_interface.lan["2"] will be created
  + resource "netbox_device_interface" "lan" {
      + description                = "Access"
      + device_id                  = 428
      + enabled                    = true
      + id                         = (known after apply)
      + label                      = "Access"
      + name                       = "eth1.2"
      + parent_device_interface_id = 1406
      + type                       = "virtual"
    }

  # module.device["R21 Dagotest"].netbox_device_primary_ip.v4 will be created
  + resource "netbox_device_primary_ip" "v4" {
      + device_id          = 428
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 4
    }

  # module.device["R21 Dagotest"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R21 Dagotest for CR3"
      + device_interface_id   = 2247
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 1
    }

  # module.device["R21 Dagotest"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R21 Dagotest for CR4"
      + device_interface_id   = 2248
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 1
    }

  # module.device["R21 Dagotest"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R21 Dagotest for CR5"
      + device_interface_id   = 2252
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 1
    }

  # module.device["R21 Dagotest"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R21 Dagotest for CR6"
      + device_interface_id   = 2251
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 1
    }

  # module.device["R21 Dagotest"].netbox_ip_address.loopback_v4 will be created
  + resource "netbox_ip_address" "loopback_v4" {
      + description           = "Loopback address for R21 Dagotest (DagoHD14)"
      + device_interface_id   = 2190
      + id                    = (known after apply)
      + ip_address            = "45.151.166.21/32"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R21 Dagotest"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR3 for R21 Dagotest"
      + id                    = (known after apply)
      + interface_id          = 2249
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 1
    }

  # module.device["R21 Dagotest"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR4 for R21 Dagotest"
      + id                    = (known after apply)
      + interface_id          = 2253
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 1
    }

  # module.device["R21 Dagotest"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR5 for R21 Dagotest"
      + id                    = (known after apply)
      + interface_id          = 94
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "virtualization.vminterface"
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 1
    }

  # module.device["R21 Dagotest"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for R21 Dagotest"
      + id                    = (known after apply)
      + interface_id          = 2250
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 1
    }

  # module.device["R21 Dagotest"].netbox_ip_address.router_addresses_v4["1"] will be created
  + resource "netbox_ip_address" "router_addresses_v4" {
      + description           = "Local router address for 'Management' network on R21 Dagotest"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "10.1.0.1/16"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 16
    }

  # module.device["R21 Dagotest"].netbox_ip_address.router_addresses_v4["2"] will be created
  + resource "netbox_ip_address" "router_addresses_v4" {
      + description           = "Local router address for 'Access' network on R21 Dagotest"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "10.2.0.1/16"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
      + vrf_id                = 16
    }

  # module.device["R21 Dagotest"].netbox_ip_address.router_addresses_v6["1"] will be created
  + resource "netbox_ip_address" "router_addresses_v6" {
      + description           = "Local router address for 'Management' network on R21 Dagotest"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "2001:678:b7c:801::1/64"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R21 Dagotest"].netbox_ip_address.router_addresses_v6["2"] will be created
  + resource "netbox_ip_address" "router_addresses_v6" {
      + description           = "Local router address for 'Access' network on R21 Dagotest"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "2001:678:b7c:802::1/64"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tenant_id             = 2
    }

  # module.device["R21 Dagotest"].netbox_prefix.networks_v4["1"] will be created
  + resource "netbox_prefix" "networks_v4" {
      + description = "'Management' network for R21 Dagotest (DagoHD14)"
      + id          = (known after apply)
      + prefix      = "10.1.0.0/16"
      + site_id     = 16
      + status      = "active"
      + tenant_id   = 2
      + vlan_id     = (known after apply)
      + vrf_id      = 16
    }

  # module.device["R21 Dagotest"].netbox_prefix.networks_v4["2"] will be created
  + resource "netbox_prefix" "networks_v4" {
      + description = "'Access' network for R21 Dagotest (DagoHD14)"
      + id          = (known after apply)
      + prefix      = "10.2.0.0/16"
      + site_id     = 16
      + status      = "active"
      + tenant_id   = 2
      + vlan_id     = (known after apply)
      + vrf_id      = 16
    }

  # module.device["R21 Dagotest"].netbox_prefix.networks_v6["1"] will be created
  + resource "netbox_prefix" "networks_v6" {
      + description = "'Management' network for R21 Dagotest (DagoHD14)"
      + id          = (known after apply)
      + prefix      = "2001:678:b7c:801::/64"
      + site_id     = 16
      + status      = "active"
      + tenant_id   = 2
      + vlan_id     = (known after apply)
    }

  # module.device["R21 Dagotest"].netbox_prefix.networks_v6["2"] will be created
  + resource "netbox_prefix" "networks_v6" {
      + description = "'Access' network for R21 Dagotest (DagoHD14)"
      + id          = (known after apply)
      + prefix      = "2001:678:b7c:802::/64"
      + site_id     = 16
      + status      = "active"
      + tenant_id   = 2
      + vlan_id     = (known after apply)
    }

  # module.device["R21 Dagotest"].netbox_vlan.networks["1"] will be created
  + resource "netbox_vlan" "networks" {
      + group_id  = (known after apply)
      + id        = (known after apply)
      + name      = "Management"
      + site_id   = 16
      + status    = "active"
      + tenant_id = 2
      + vid       = 1
    }

  # module.device["R21 Dagotest"].netbox_vlan.networks["2"] will be created
  + resource "netbox_vlan" "networks" {
      + group_id  = (known after apply)
      + id        = (known after apply)
      + name      = "Access"
      + site_id   = 16
      + status    = "active"
      + tenant_id = 2
      + vid       = 2
    }

  # module.device["R21 Dagotest"].netbox_vlan_group.group will be created
  + resource "netbox_vlan_group" "group" {
      + id         = (known after apply)
      + max_vid    = 256
      + min_vid    = 1
      + name       = "R21 Dagotest"
      + scope_id   = 16
      + scope_type = "dcim.site"
      + slug       = "R21 Dagotest"
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v4["CR3"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "146"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v4["CR4"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "149"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v4["CR5"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "166"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v4["CR6"] will be updated in-place
  ~ resource "netbox_available_prefix" "tunnels_v4" {
        id               = "434"
        tags             = []
      ~ vrf_id           = 0 -> 1
        # (11 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "276"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "310"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "349"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "local_tunnel_address_v4" {
        id                    = "856"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (8 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "275"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "309"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "357"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v4["CR6"] will be updated in-place
  ~ resource "netbox_ip_address" "remote_tunnel_address_v4" {
        id                    = "845"
        tags                  = []
      ~ vrf_id                = 0 -> 1
        # (9 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_vlan_group.group will be updated in-place
  ~ resource "netbox_vlan_group" "group" {
        id          = "10"
      ~ max_vid     = 0 -> 256
      ~ min_vid     = 0 -> 1
        name        = "R9"
        tags        = []
        # (4 unchanged attributes hidden)
    }

Plan: 27 to add, 91 to change, 4 to destroy.
```